In [1]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
series=[4,8,15,16,23,42]

In [28]:
pd1=pd.Series(series)

In [10]:
pd1(

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [9]:
type(pd1)

pandas.core.series.Series

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [5]:
list=[1,2,3,4,5,6,7,8,9,10]

In [6]:
pd.Series(list)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [15]:
data={"Name":['Alice','Bob','Claire'],
"Bob":[25,30,27],
"Gender":['Female','Male','Female']
}

In [25]:
df2=pd.DataFrame(data)

In [26]:
df2

     Name  Bob  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans:
As noted in the table, a Pandas Series is a 1D array of data, but a single-column DataFrame is a 2D table with one column. The main distinction between the two is this. For a single-column DataFrame, an index can be optional, but a Series has to have an index defined.

In [29]:
series=[4,8,15,16,23,42]
pd.Series(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [33]:
pd.DataFrame(series)

    0
0   4
1   8
2  15
3  16
4  23
5  42

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Ans:-some common functions you can use to manipulate data in a Pandas DataFrame

Read()

Head()

tail()

columns()

shpe()

size()

etc.....

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans:-All Pandas data structures are value mutable (can be changed) and except Series all are size mutable. Series is size immutable. Note − DataFrame is widely used and one of the most important data structures. Panel is used much less.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [50]:
Name=pd.Series(['surya','anam','anil','anni'])
Age=pd.Series([20,332,23,24])
Sex=pd.Series(['Male','Male','Male','Female'])

In [51]:
df=pd.concat([Name,Age],axis=1)

In [52]:
df

       0    1
0  surya   20
1   anam  332
2   anil   23
3   anni   24

In [53]:
df1=pd.concat([Name,Age,Sex],axis=1)

In [54]:
df1

       0    1       2
0  surya   20    Male
1   anam  332    Male
2   anil   23    Male
3   anni   24  Female